In [1]:
# Import the SQL ALchemy engine
from sqlalchemy import create_engine

In [2]:
# Database credentials
postgres_user = 'dsbc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'medicalcosts'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

In [3]:
# Use the connection to execute some SQL
insurance = engine.execute('SELECT * FROM medicalcosts LIMIT 10')

# no need for an open connection, as we're only doing a single query
engine.dispose()

# Process the results
for row in insurance:
  print(row)

(19, 'female', 27.9, 0, 'yes', 'southwest', 16884.9)
(18, 'male', 33.77, 1, 'no', 'southeast', 1725.55)
(28, 'male', 33.0, 3, 'no', 'southeast', 4449.46)
(33, 'male', 22.705, 0, 'no', 'northwest', 21984.5)
(32, 'male', 28.88, 0, 'no', 'northwest', 3866.86)
(31, 'female', 25.74, 0, 'no', 'southeast', 3756.62)
(46, 'female', 33.44, 1, 'no', 'southeast', 8240.59)
(37, 'female', 27.74, 3, 'no', 'northwest', 7281.51)
(37, 'male', 29.83, 2, 'no', 'northeast', 6406.41)
(60, 'female', 25.84, 0, 'no', 'northwest', 28923.1)

# ResultProxy

In [4]:
# get a list of the keys (column names) 
insurance.keys()

['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges']

In [5]:
for row in insurance:
  print(row)

In [6]:
# Execute the SQL statement again
insurance = engine.execute('SELECT * FROM medicalcosts LIMIT 10')

# dispose the connection
engine.dispose()

# use fetchall() to get a list of rows from the results.
rows = insurance.fetchall()

# now process the list of rows
for row in rows:
  print(row)

(19, 'female', 27.9, 0, 'yes', 'southwest', 16884.9)
(18, 'male', 33.77, 1, 'no', 'southeast', 1725.55)
(28, 'male', 33.0, 3, 'no', 'southeast', 4449.46)
(33, 'male', 22.705, 0, 'no', 'northwest', 21984.5)
(32, 'male', 28.88, 0, 'no', 'northwest', 3866.86)
(31, 'female', 25.74, 0, 'no', 'southeast', 3756.62)
(46, 'female', 33.44, 1, 'no', 'southeast', 8240.59)
(37, 'female', 27.74, 3, 'no', 'northwest', 7281.51)
(37, 'male', 29.83, 2, 'no', 'northeast', 6406.41)
(60, 'female', 25.84, 0, 'no', 'northwest', 28923.1)

In [7]:
for row in rows[:5]:
  print(row)

(19, 'female', 27.9, 0, 'yes', 'southwest', 16884.9)
(18, 'male', 33.77, 1, 'no', 'southeast', 1725.55)
(28, 'male', 33.0, 3, 'no', 'southeast', 4449.46)
(33, 'male', 22.705, 0, 'no', 'northwest', 21984.5)
(32, 'male', 28.88, 0, 'no', 'northwest', 3866.86)

In [8]:
for row in rows[-5:]:
  print(row)

(31, 'female', 25.74, 0, 'no', 'southeast', 3756.62)
(46, 'female', 33.44, 1, 'no', 'southeast', 8240.59)
(37, 'female', 27.74, 3, 'no', 'northwest', 7281.51)
(37, 'male', 29.83, 2, 'no', 'northeast', 6406.41)
(60, 'female', 25.84, 0, 'no', 'northwest', 28923.1)

# RowProxy

In [9]:
# get the first row from the list
first_row = rows[0]

# get the data type of this row
type(first_row)

sqlalchemy.engine.result.RowProxy

## has_key()

In [10]:
print('The first row has a key named `age`: {}'.format(first_row.has_key('age')))
print('The first row has a key named `height`: {}'.format(first_row.has_key('height')))

The first row has a key named `age`: True
The first row has a key named `height`: False

## keys()

In [11]:
first_row.keys()

['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges']

## items()

In [12]:
first_row.items()

[('age', 19),
 ('sex', 'female'),
 ('bmi', 27.9),
 ('children', 0),
 ('smoker', 'yes'),
 ('region', 'southwest'),
 ('charges', 16884.9)]

In [13]:
# Access it by position
bmi = first_row[2]

# Access if by column name
charges = first_row['charges']

print('The first row has a bmi of {} and charges of {}'.format(bmi, charges))

The first row has a bmi of 27.9 and charges of 16884.9

# Processing the Data

## WHERE Clause

In [14]:
# Find the total number of rows in the table
row_count = engine.execute('SELECT COUNT(*) FROM medicalcosts')

# dispose the connection
engine.dispose()

# fetch the first row from the Results
ans = row_count.first()

# print the count
print('There are {} rows in the table'.format(ans['count']))

There are 1338 rows in the table

In [15]:
sql = '''
SELECT 
  COUNT(*) 
FROM 
  medicalcosts
WHERE 
  sex = 'female' '''

row_count = engine.execute(sql)
engine.dispose()
ans = row_count.first()
print('There are {} females in the table'.format(ans['count']))

There are 662 females in the table

In [16]:
sql = '''
SELECT 
  COUNT(*) 
FROM 
  medicalcosts
WHERE 
  sex = 'female'
  AND age BETWEEN 18 AND 30'''

row_count = engine.execute(sql)
engine.dispose()
ans = row_count.first()
print('There are {} females between 18 and 30 in the table'.format(ans['count']))

There are 214 females between 18 and 30 in the table

In [17]:
sql = '''
SELECT 
  charges 
FROM 
  medicalcosts
WHERE 
  sex = 'female'
  AND age BETWEEN 18 AND 30'''

charges = engine.execute(sql)
engine.dispose()

rows = charges.fetchall()

# At this point the rows list contain RowProxy objects,
# but we really only need the numeric value so lets extract
# the numeric value into a list of raw numbers

charges = [x['charges'] for x in rows]
print(charges)

[16884.9, 4149.74, 2198.19, 4687.8, 3046.06, 3393.36, 3556.92, 2211.13, 3579.83, 4133.64, 14711.7, 1743.21, 16577.8, 3947.41, 2755.02, 2026.97, 3766.88, 21344.8, 2331.52, 2404.73, 19107.8, 2257.48, 3385.4, 17081.1, 2457.21, 2155.68, 2166.73, 5138.26, 36149.5, 4830.63, 2719.28, 2855.44, 1631.82, 3981.98, 5325.65, 4922.92, 2130.68, 37133.9, 4337.74, 3392.98, 25081.8, 1727.79, 1615.77, 38511.6, 17085.3, 2150.47, 3172.02, 2156.75, 4349.46, 20177.7, 4151.03, 1737.38, 34838.9, 24671.7, 3561.89, 18955.2, 3554.2, 14133.0, 1607.51, 13844.5, 2597.78, 3180.51, 18034.0, 15006.6, 3176.82, 4618.08, 2138.07, 1631.67, 14455.6, 2134.9, 7323.73, 3167.46, 18804.8, 4906.41, 19522.0, 23288.9, 2201.1, 2203.47, 1744.46, 1622.19, 1748.77, 2196.47, 3044.21, 11482.6, 24059.7, 3056.39, 3213.62, 17878.9, 2801.26, 2128.43, 2219.45, 4753.64, 3206.49, 15359.1, 1633.04, 17469.0, 3558.62, 2207.7, 1880.07, 34439.9, 3736.46, 3366.67, 2709.11, 4466.62, 3410.32, 3943.6, 2585.27, 3578.0, 3201.25, 3500.61, 2020.55, 2457.5, 40932.4, 16657.7, 2217.6, 4234.93, 3925.76, 17748.5, 2731.91, 4719.52, 38792.7, 2136.88, 1877.93, 2842.76, 1621.88, 4719.74, 36021.0, 2974.13, 1875.34, 18218.2, 4391.65, 3392.37, 2690.11, 2585.85, 1634.57, 2117.34, 4564.19, 2473.33, 2913.57, 2217.47, 4527.18, 2730.11, 3353.28, 2527.82, 1759.34, 16796.4, 14571.9, 3378.91, 16420.5, 2709.24, 3987.93, 26019.0, 35595.6, 2020.18, 4137.52, 3161.45, 3594.17, 3353.47, 2480.98, 5708.87, 33907.5, 4561.19, 3227.12, 5312.17, 5693.43, 34166.3, 18903.5, 40904.2, 1728.9, 3176.29, 36898.7, 2261.57, 2203.74, 14426.1, 2459.72, 2200.83, 4529.48, 2154.36, 2899.49, 2850.68, 2632.99, 18328.2, 13126.7, 18838.7, 33307.6, 18223.5, 3956.07, 4718.2, 26125.7, 20167.3, 3238.44, 4296.27, 3171.61, 1633.96, 1880.49, 3021.81, 2741.95, 4189.11, 14283.5, 3732.62, 4340.44, 2710.83, 3208.79, 2464.62, 16115.3, 33900.7, 36397.6, 18765.9, 1731.68, 22395.7, 10795.9, 2205.98, 1629.83, 2007.94]

## Mean

In [18]:
# A simple implementation simply iterating the array
def mean(numbers):
  total_sum = 0;  # initialize the sum to zero
  for n in numbers:
    total_sum += n # add up the numbers in the array
  count = len(numbers)   # find the length of the array
  avg = total_sum / count  # calculate the mean
  return avg  # return the result

print('The mean of the charges is {}'.format(mean(charges)))

The mean of the charges is 8624.224345794393

## Median

In [19]:
alist = [5, 2, 4, 1, 3]
alist.sort()
print(alist)

[1, 2, 3, 4, 5]

In [20]:
alist = [5, 2, 4, 1, 3]
sorted_list = sorted(alist)
print(sorted_list)
print(alist)

[1, 2, 3, 4, 5]
[5, 2, 4, 1, 3]

In [21]:
import math

def median(numbers):
  numbers.sort()  # sort the list of numbers
  count = len(numbers) # get the length of the array
  isEven = count % 2 == 0 # check if this list is of even length
  
  if (isEven):
    # find the two numbers in the middle of the array
    mid = math.floor( count / 2 )
    a = numbers[mid - 1]
    b = numbers[mid]
    # find the average of these two numbers
    ans = (a + b) / 2
  else:
    ans = numbers[math.floor( count / 2 )]
 
  return ans

print('The median of the charges is {}'.format(median(charges)))

The median of the charges is 3527.4049999999997

## Standard Deviation

In [22]:
def standard_deviation(numbers):
  X_bar = mean(numbers)
  N = len(numbers)
  total_sum = 0
  for X in numbers:
    diff = X - X_bar
    squared = math.pow(diff, 2)
    total_sum += squared
  sigma = math.sqrt(total_sum / (N - 1))  
  return sigma

print('The standard deviation of the charges is {}'.format(standard_deviation(charges)))

The standard deviation of the charges is 10114.063803685161

# FILM EXAMPLE

In [23]:
# Database credentials
postgres_user = 'dsbc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'dvdrentals'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

In [24]:
sql = '''
  SELECT COUNT(*) AS count, a.actor_id, a.first_name, a.last_name 
  FROM film f 
  JOIN film_actor fa 
  ON f.film_id = fa.film_id 
  JOIN actor a 
  ON a.actor_id = fa.actor_id 
  JOIN film_category fc 
  ON fc.film_id = f.film_id
  JOIN category c
  ON c.category_id = fc.category_id
  WHERE c.name = 'Comedy'
  GROUP BY a.actor_id
  ORDER BY count DESC
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows:
  print(row)

(6, 196, 'BELA', 'WALKEN')
(5, 143, 'RIVER', 'DEAN')
(5, 149, 'RUSSELL', 'TEMPLE')
(4, 129, 'DARYL', 'CRAWFORD')
(4, 76, 'ANGELINA', 'ASTAIRE')
(4, 58, 'CHRISTIAN', 'AKROYD')
(4, 24, 'CAMERON', 'STREEP')
(4, 83, 'BEN', 'WILLIS')
(4, 37, 'VAL', 'BOLGER')
(4, 198, 'MARY', 'KEITEL')
(4, 101, 'SUSAN', 'DAVIS')
(4, 82, 'WOODY', 'JOLIE')
(4, 127, 'KEVIN', 'GARLAND')
(3, 159, 'LAURA', 'BRODY')
(3, 71, 'ADAM', 'GRANT')
(3, 162, 'OPRAH', 'KILMER')
(3, 84, 'JAMES', 'PITT')
(3, 173, 'ALAN', 'DREYFUSS')
(3, 42, 'TOM', 'MIRANDA')
(3, 125, 'ALBERT', 'NOLTE')
(3, 153, 'MINNIE', 'KILMER')
(3, 147, 'FAY', 'WINSLET')
(3, 19, 'BOB', 'FAWCETT')
(3, 81, 'SCARLETT', 'DAMON')
(3, 17, 'HELEN', 'VOIGHT')
(3, 54, 'PENELOPE', 'PINKETT')
(3, 34, 'AUDREY', 'OLIVIER')
(3, 90, 'SEAN', 'GUINESS')
(3, 45, 'REESE', 'KILMER')
(3, 107, 'GINA', 'DEGENERES')
(3, 89, 'CHARLIZE', 'DENCH')
(3, 31, 'SISSY', 'SOBIESKI')
(3, 158, 'VIVIEN', 'BASINGER')
(3, 13, 'UMA', 'WOOD')
(3, 133, 'RICHARD', 'PENN')
(3, 128, 'CATE', 'MCQUEEN')
(3, 99, 'JIM', 'MOSTEL')
(3, 191, 'GREGORY', 'GOODING')
(2, 119, 'WARREN', 'JACKMAN')
(2, 25, 'KEVIN', 'BLOOM')
(2, 43, 'KIRK', 'JOVOVICH')
(2, 69, 'KENNETH', 'PALTROW')
(2, 26, 'RIP', 'CRAWFORD')
(2, 85, 'MINNIE', 'ZELLWEGER')
(2, 187, 'RENEE', 'BALL')
(2, 57, 'JUDE', 'CRUISE')
(2, 154, 'MERYL', 'GIBSON')
(2, 160, 'CHRIS', 'DEPP')
(2, 172, 'GROUCHO', 'WILLIAMS')
(2, 21, 'KIRSTEN', 'PALTROW')
(2, 92, 'KIRSTEN', 'AKROYD')
(2, 74, 'MILLA', 'KEITEL')
(2, 177, 'GENE', 'MCKELLEN')
(2, 29, 'ALEC', 'WAYNE')
(2, 182, 'DEBBIE', 'AKROYD')
(2, 181, 'MATTHEW', 'CARREY')
(2, 105, 'SIDNEY', 'CROWE')
(2, 86, 'GREG', 'CHAPLIN')
(2, 144, 'ANGELA', 'WITHERSPOON')
(2, 163, 'CHRISTOPHER', 'WEST')
(2, 106, 'GROUCHO', 'DUNST')
(2, 50, 'NATALIE', 'HOPKINS')
(2, 102, 'WALTER', 'TORN')
(2, 185, 'MICHAEL', 'BOLGER')
(2, 111, 'CAMERON', 'ZELLWEGER')
(2, 2, 'NICK', 'WAHLBERG')
(2, 62, 'JAYNE', 'NEESON')
(2, 199, 'JULIA', 'FAWCETT')
(2, 146, 'ALBERT', 'JOHANSSON')
(2, 152, 'BEN', 'HARRIS')
(2, 41, 'JODIE', 'DEGENERES')
(2, 157, 'GRETA', 'MALDEN')
(2, 12, 'KARL', 'BERRY')
(2, 164, 'HUMPHREY', 'WILLIS')
(2, 112, 'RUSSELL', 'BACALL')
(2, 135, 'RITA', 'REYNOLDS')
(2, 65, 'ANGELA', 'HUDSON')
(2, 124, 'SCARLETT', 'BENING')
(2, 132, 'ADAM', 'HOPPER')
(2, 44, 'NICK', 'STALLONE')
(2, 80, 'RALPH', 'CRUZ')
(2, 161, 'HARVEY', 'HOPE')
(2, 188, 'ROCK', 'DUKAKIS')
(2, 40, 'JOHNNY', 'CAGE')
(1, 193, 'BURT', 'TEMPLE')
(1, 180, 'JEFF', 'SILVERSTONE')
(1, 168, 'WILL', 'WILSON')
(1, 93, 'ELLEN', 'PRESLEY')
(1, 98, 'CHRIS', 'BRIDGES')
(1, 175, 'WILLIAM', 'HACKMAN')
(1, 36, 'BURT', 'DUKAKIS')
(1, 64, 'RAY', 'JOHANSSON')
(1, 137, 'MORGAN', 'WILLIAMS')
(1, 78, 'GROUCHO', 'SINATRA')
(1, 167, 'LAURENCE', 'BULLOCK')
(1, 66, 'MARY', 'TANDY')
(1, 109, 'SYLVESTER', 'DERN')
(1, 60, 'HENRY', 'BERRY')
(1, 155, 'IAN', 'TANDY')
(1, 178, 'LISA', 'MONROE')
(1, 118, 'CUBA', 'ALLEN')
(1, 130, 'GRETA', 'KEITEL')
(1, 113, 'MORGAN', 'HOPKINS')
(1, 116, 'DAN', 'STREEP')
(1, 97, 'MEG', 'HAWKE')
(1, 108, 'WARREN', 'NOLTE')
(1, 141, 'CATE', 'HARRIS')
(1, 117, 'RENEE', 'TRACY')
(1, 15, 'CUBA', 'OLIVIER')
(1, 79, 'MAE', 'HOFFMAN')
(1, 156, 'FAY', 'WOOD')
(1, 48, 'FRANCES', 'DAY-LEWIS')
(1, 52, 'CARMEN', 'HUNT')
(1, 126, 'FRANCES', 'TOMEI')
(1, 72, 'SEAN', 'WILLIAMS')
(1, 95, 'DARYL', 'WAHLBERG')
(1, 194, 'MERYL', 'ALLEN')
(1, 166, 'NICK', 'DEGENERES')
(1, 47, 'JULIA', 'BARRYMORE')
(1, 197, 'REESE', 'WEST')
(1, 77, 'CARY', 'MCCONAUGHEY')
(1, 142, 'JADA', 'RYDER')
(1, 115, 'HARRISON', 'BALE')
(1, 11, 'ZERO', 'CAGE')
(1, 20, 'LUCILLE', 'TRACY')
(1, 28, 'WOODY', 'HOFFMAN')
(1, 192, 'JOHN', 'SUVARI')
(1, 104, 'PENELOPE', 'CRONYN')
(1, 5, 'JOHNNY', 'LOLLOBRIGIDA')
(1, 91, 'CHRISTOPHER', 'BERRY')
(1, 46, 'PARKER', 'GOLDBERG')
(1, 114, 'MORGAN', 'MCDORMAND')
(1, 183, 'RUSSELL', 'CLOSE')
(1, 179, 'ED', 'GUINESS')
(1, 4, 'JENNIFER', 'DAVIS')
(1, 38, 'TOM', 'MCKELLEN')
(1, 150, 'JAYNE', 'NOLTE')
(1, 170, 'MENA', 'HOPPER')
(1, 67, 'JESSICA', 'BAILEY')
(1, 63, 'CAMERON', 'WRAY')
(1, 10, 'CHRISTIAN', 'GABLE')
(1, 33, 'MILLA', 'PECK')
(1, 140, 'WHOOPI', 'HURT')
(1, 1, 'PENELOPE', 'GUINESS')
(1, 70, 'MICHELLE', 'MCCONAUGHEY')
(1, 134, 'GENE', 'HOPKINS')
(1, 139, 'EWAN', 'GOODING')

In [25]:
counts = [row['count'] for row in rows]

print('The mean number of comedy movies by actor is {}'.format(mean(counts)))
print('The median number of comedy movies by actor is {}'.format(median(counts)))
print('The standard deviation of appearances in comedy movies is {}'.format(standard_deviation(counts)))

The mean number of comedy movies by actor is 1.945578231292517
The median number of comedy movies by actor is 2
The standard deviation of appearances in comedy movies is 1.051953908863022